Tekla Open API Reference for Tekla Structures 2025
DistanceList.Contains Method
 Determines whether the specified item is in the list.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Contains(
	Distance item
)
Public Function Contains (
	item As Distance
) As Boolean
Parameters
item
Type: Tekla.Structures.Datatype.Distance
The item to be matched.
Return Value
Type: Boolean
A boolean value indicating whether the item was found.
Implements
ICollection<T>.Contains(T)
Examples
 This example shows how to determine whether the specified Distance instance is contained in a DistanceList.
using Tekla.Structures.Datatype;
public class Example
{
       public void Example1()
       {
           // We'll use this distance list to demonstrate the Contains method.
           DistanceList distanceList = new DistanceList(new Distance[]
                                                       {
                                                           new Distance(30.2),
                                                           new Distance(30.2),
                                                           new Distance(30.2),
                                                           new Distance(50),
                                                           new Distance(2.3),
                                                           new Distance(2.3),
                                                       });
           bool isInList = distanceList.Contains(new Distance(50));
       }
}
See Also
Reference
DistanceList Structure
Tekla.Structures.Datatype Namespace